In [ ]:
import pandas as pd
Series = pd.Series([4,7,-5,3])

In [ ]:
import numpy as np

In [ ]:
Series.index

In [ ]:
Series.values

In [ ]:
import numpy as np
np_array = np.arange(0,19,2)

In [ ]:
np_array

In [ ]:
np_array.index

In [ ]:
Series

In [ ]:
object2 = pd.Series([4,7,-5,3],index = ['a','b','c','d'])

In [ ]:
object2.index

In [ ]:
object2['a']

In [ ]:
object2[0]

In [ ]:
object2[['a','c']]

In [ ]:
object2[object2>0]

In [ ]:
object2*2

In [ ]:
np.exp(object2)

Modify Series in place using values from passed Series.

In [ ]:
Series

In [ ]:
object3= object2.copy()
object3

In [ ]:
object2 = np_array
object2

In [ ]:
np_array = [2,3,4,5]
np_array

In [ ]:
object3

In [ ]:
object3.update(pd.Series([2,3,4,5]))
object3

In [ ]:
object3.update(pd.Series([2,3,4,5],index=['a','b','c','d']))
object3

In [ ]:
###modify only one element in a series
object3['b']=4
object3

In [ ]:
object3.update(pd.Series([0,0],index=['a','b']))
object3

In [ ]:
object3[['c','d']]=[0,0]
object3

In [ ]:
dictionary = {'Ohio':3500, 'Texa': 71000,'Oregon':16000,'Utah': 5000}
obj3 = pd.Series(dictionary)

In [ ]:
obj3

In [ ]:
obj4 = pd.Series(dictionary,index=['Ohio','Oregon','Texa','Utah'])

In [ ]:
obj4

In [ ]:
obj5 = pd.Series(dictionary,index=['Ohio','Oregon','Texa','California'])

In [ ]:
obj5

Naming series and its index

In [ ]:
obj5.name = 'population'
obj5.index.name = 'state'

In [ ]:
obj5

A Series's index can be altered in-place by assignment

In [ ]:
obj5.index = ['Bob','Steve','Jeff','Ryan']

In [ ]:
obj5

Modifying Pandas Series Elements
<series object> [<index>] = <new data value>
Change a slice of values
<series object> [start : stop] = <new data value>

In [ ]:
obj5['Bob'] = 0

In [ ]:
obj5

In [ ]:
obj5['Bob':'Steve'] = 0

In [ ]:
obj5

In [ ]:
obj5['Bob':'Steve'] = [3500,16000]

In [ ]:
obj5

# DATAFRAME

In [4]:
data = {'State' : ['Ohio','Ohio','Ohio','Nevada','Neveda','Nevada'],\
       'year':[2000,2001,2002,2001,2002,2003],\
       'pop': [1.5,1.7,3.5,2.4,2.9,3.2]}
df = pd.DataFrame(data)

In [ ]:
df

In [ ]:
df2 = pd.DataFrame(data,index = ['a','b','c','d','e','f']\
                   ,columns = ['year','State','pop'])

In [ ]:
df2

In [ ]:
df2 = df2[['State','year','pop']]

In [ ]:
df2

You can pass the index and specify a sequence of columns, the DataFrameâ€™s columns will be arranged in that order

In [ ]:
df2

In [ ]:
df3 = pd.DataFrame(data,columns = ['year','State','population'])
df3

CHANGING THE ORDER OF COLUMN AND CHANGING THE COLUMN NAMES

In [ ]:
df2

In [ ]:
df2.columns = ['State','year','pop']

In [ ]:
df2

In [ ]:
df2 = df2[['State','year','pop']]
df2

In [ ]:
df['State']

In [ ]:
df.State

In [ ]:
df.columns = [col+'@' for col in df.columns]
df

In [ ]:
df['State@']

In [ ]:
df.State@

In [ ]:
df.loc[:1,'State']

DataFrame[column] works for any column name, but DataFrame.column only works when the column name is a valid Python variable name.
- A variable name must start with a letter or the underscore character
- A variable name cannot start with a number
- A variable name can only contain alpha-numeric characters and underscores (A-z, 0-9, and _ )
Variable names are case-sensitive (age, Age and AGE are three different variables)

In [ ]:
df2.columns = ['State@','year','pop']

In [ ]:
df2['State@']

In [ ]:
df2.State@

In [ ]:
df2.columns = ['1State','year','pop']

In [ ]:
df2.1State

# Access DataFramesâ€™s elements

In [2]:
import pandas as pd

In [5]:
###pass a column that isn't contained in the dict, it will appear with missing values in the result
df3 = pd.DataFrame(data,columns = ['year','state','pop','debt'],\
                  index = ['one','two','three','four','five','six'])
df3

       year state  pop debt
one    2000   NaN  1.5  NaN
two    2001   NaN  1.7  NaN
three  2002   NaN  3.5  NaN
four   2001   NaN  2.4  NaN
five   2002   NaN  2.9  NaN
six    2003   NaN  3.2  NaN

CREATE A NEW COLUMN

In [6]:
df3['debt'] = 16.5

In [7]:
df3

       year state  pop  debt
one    2000   NaN  1.5  16.5
two    2001   NaN  1.7  16.5
three  2002   NaN  3.5  16.5
four   2001   NaN  2.4  16.5
five   2002   NaN  2.9  16.5
six    2003   NaN  3.2  16.5

In [9]:
import numpy as np
df3['debt'] = np.arange(6.)
df3

       year state  pop  debt
one    2000   NaN  1.5   0.0
two    2001   NaN  1.7   1.0
three  2002   NaN  3.5   2.0
four   2001   NaN  2.4   3.0
five   2002   NaN  2.9   4.0
six    2003   NaN  3.2   5.0

In [10]:
val = pd.Series([-1.2,-1.5,-1.7,0,0])
df3['debt'] = val
df3

       year state  pop  debt
one    2000   NaN  1.5   NaN
two    2001   NaN  1.7   NaN
three  2002   NaN  3.5   NaN
four   2001   NaN  2.4   NaN
five   2002   NaN  2.9   NaN
six    2003   NaN  3.2   NaN

In [11]:
val = pd.Series([-1.2,-1.5,-1.7,0,0,0],\
                index = ['one','two','three','four','five','six'])
df3['debt'] = val
df3

       year state  pop  debt
one    2000   NaN  1.5  -1.2
two    2001   NaN  1.7  -1.5
three  2002   NaN  3.5  -1.7
four   2001   NaN  2.4   0.0
five   2002   NaN  2.9   0.0
six    2003   NaN  3.2   0.0

In [ ]:
val = pd.Series([-1.2,-1.5,-1.7,0,0,0],\
                index = ['one','two','three',4,5,6])
df3['debt'] = val
df3

In [ ]:
val = pd.Series([-1.2,-1.5,-1.7],index = ['one','two','three'])
df3['debt'] = val
df3

Constructing DataFrame from dict of dicts: 
- Outer dicts keys -> columns
- Inner keys -> row indices

In [ ]:
###population for each year
pop = {'Neveda':{2001: 2.4, 2002: 2.9},\
      'Ohio':{2000: 1.5, 2001: 1.7, 2002: 3.6}}
df4 = pd.DataFrame(pop)
df4

In [ ]:
 pd.DataFrame(pop,index=[2000,2001,2002])

In [ ]:
 pd.DataFrame(pop,index=[2001,2002])

Construct DataFrame from dict of Series: 
- Outer dicts keys -> columns
- Inner keys -> row indices

In [ ]:
df4

In [ ]:
pdata = {'Neveda': df4['Neveda'][:-1],\
        'Ohio':df4['Ohio'][:-1]}
df5 = pd.DataFrame(pdata)

In [ ]:
df5

try df4['Neveda'].loc[[2001,20002]] and df4['Ohio'].loc[[2000,2001]]

Constructing DataFrame from numpy ndarray

In [ ]:
ndarray = np.array([[-2,1,3],[0,1,3]])
pd.DataFrame(ndarray,index=['i1','i2'],columns = ['a','b','c'])

Contructing DataFrame from list of dicts

In [ ]:
list_ = [{'a':1},{'b':2},{'c':3}]
pd.DataFrame(list_)

In [ ]:
# Initialise data to lists. 
data = [{'Geeks': 'dataframe', 'For': 'using', 'geeks': 'list'},
        {'Geeks':10, 'For':20,'geeks': 30}]
df = pd.DataFrame(data)

In [ ]:
df

In [ ]:
data = pd.Series([1,2,3],index=['a','b','c'])

In [ ]:
data

Swap the position of two rows in a pandas DataFrame?

In [ ]:
a = pd.DataFrame(data = [[1,2],[3,4]], index=range(2), columns = ['A', 'B'])
a

In [ ]:
b, c = a.iloc[0].copy(), a.iloc[1].copy()
a.iloc[0],a.iloc[1] = c,b

In [ ]:
a